<template>
    <article class="page page_bg page_warning">
        <div class="romanov-intro">
            <div class="container romanov-intro__container">
                <div class="romanov-intro__quote animate">
                    <div class="romanov-intro__quote--text">«Мне хочется, чтобы эта водка отразила душу русского народа, мою любовь к России и уважение к памяти моих предков.»</div>
                    <div class="romanov-intro__quote--signature">
                        <img src="~/assets/img/romanov/signature.svg" alt="Signature">
                    </div>
                </div>
                <div class="romanov-intro__logo animate">
                    <img src="~/assets/img/romanov/romanov-logo.png" alt="Romanov Vodka">
                </div>
            </div>
        </div>
        <div class="romanov-content">
            <div class="romanov-content__container container">
                <div class="romanov-content__bottle animate">
                    <img src="~/assets/img/romanov/bottle.png" alt="Bottle">
                </div>
                <div class="romanov-content__product animate">
                    <div class="romanov-content__main">
                        <div class="romanov-content__title">Водка ROMANOV – это классика во всём!</div>
                        <div class="romanov-content__text">
                            Традиционная русская водка была непременным атрибутом императорских торжеств. Чистейший зерновой спирт, кристально чистая вода, настой пшеницы рецептура водки проста.<br>Но при кажущейся простоте водка исключительно сложна в изготовлении, поскольку требует ингредиентов высочайшего качества и тщательного контроля на каждом этапе производства.
                        </div>
                    </div>
                    <div class="romanov-product">
                        <div class="romanov-product__info animate">
                            <div class="romanov-product__title">Водка ROMANOV</div>
                            <div class="romanov-product__text romanov-product__toggle">
                                При разработке рецептуры продукции учитывались результаты проведенных потребительских исследований.
                                <br>
                                В «слепых» дегустациях сравнивались лучшие российские и западные водки на рынке.
                                <br>
                                В итоге выбор был сделан в пользу классического для русской водки состава:
                                <br>«Вода питьевая исправленная, спирт этиловый ректификованный «Люкс» (зерновой), сахар белый, настой пшеницы».
                            </div>
                            <div class="romanov-product__list">
                                <div class="romanov-product__list--item">
                                    <span>Крепость:</span>
                                    40% об.
                                </div>
                                <div class="romanov-product__list--item">
                                    <span>Объем:</span>
                                    0,5&nbsp;л; 0,7&nbsp;л; 0,7&nbsp;л в&nbsp;подарочной упаковке; 1,75&nbsp;л
                                </div>
                            </div>
                            <div class="romanov-product__more">Подробнее</div>
                        </div>
                        <div class="romanov-product__bottle animate">
                            <img src="~/assets/img/romanov/bottle.png" alt="Romanov Vodka">
                        </div>
                    </div>
                </div>
                <div class="romanov-content__info animate">
                    <div class="romanov-content__palace">
                        <img src="~/assets/img/romanov/palace.png" alt="Palace" class="romanov-content__palace--image_desktop">
                        <img src="~/assets/img/romanov/palace-mobile.png" alt="Palace" class="romanov-content__palace--image_mobile">
                    </div>
                    <div class="romanov-content__history">
                        <div class="romanov-content__subtitle">
                            Более чем столетняя история – залог опытных кадров
                            <br>
                            и трепетного отношения
                            <br>к качеству продукции!
                        </div>
                        <div class="romanov-content__text">
                            Для фильтрации сортировки применяется <span>уникальный березовый уголь</span>
                            , обогащенный серебром. Это <span>классическая русская технология очистки спиртов.</span>
                            <br>И достаточно будет сказать, что именно на пермском угле работает вся российская водочная промышленность.
                        </div>
                        <div class="romanov-content__text">
                            Для охлаждения сортировки применяется <span>технология низких температур</span>
                            , позволяющая <span>существенно улучшить органолептические качества продукта.</span>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="romanov-advantages">
            <div class="romanov-advantages__container container">
                <div
                    class="romanov-advantages__left"
                    :class="{
                        'romanov-advantages__left romanov-advantages__left_opened': leftOpen
                    }"
                >
                    <advantage
                        v-for="item in advantages"
                        :key="item.num"
                        :num="item.num"
                        :mobile-num="currentNum"
                        :text="item.text"
                        @toggle="toggle('left')"
                    />
                </div>
                <div class="romanov-advantages__main">
                    <div class="romanov-advantages__bottle romanov-advantages__bottle_desktop">
                        <img src="~/assets/img/romanov/main-bottle.png" alt="Main bottle">
                    </div>
                    <div class="romanov-advantages__bottle romanov-advantages__bottle_mobile">
                        <img src="~/assets/img/romanov/main-bottle-legacy.png" alt="Main bottle">
                    </div>
                    <div
                        v-for="item in 8"
                        :key="item"
                        :class="`romanov-advantages__button_${item}`"
                        class="romanov-advantages__button"
                        @click="currentNum = item"
                    >
                        {{ item }}
                    </div>
                </div>
                <div
                    class="romanov-advantages__right"
                    :class="{
                        'romanov-advantages__right_opened': rightOpen
                    }"
                >
                    <advantage
                        v-for="item in advRight"
                        :key="item.num"
                        :num="item.num"
                        :mobile-num="currentNum"
                        :text="item.text"
                        @toggle="toggle('right')"
                    />
                </div>
            </div>
            <div class="romanov-present container">
                <div class="romanov-present__content">
                    <div class="romanov-present__text">Водка
                      <span class="romanov-present__text__it">
                        ROMANOV
                      </span>
                      0,7 в подарочной упаковке.</div>
                    <div class="romanov-present__text">Лафитник из богемского стекла в подарок.</div>
                </div>
                <div class="romanov-present__image">
                    <img src="~/assets/img/romanov/present.png" alt="Водка Romanov 0,7 в подарчной упаковке.">
                </div>
            </div>
            <div class="romanov-advantages__cities">
                <svg width="609" height="16" viewBox="0 0 609 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M15.6287 15L15.6087 0.999999H13.9687L8.20866 10.84L2.36866 0.999999H0.728662V15H2.64866V4.86L7.70866 13.3H8.62866L13.6887 4.8L13.7087 15H15.6287ZM27.1502 15.16C31.4102 15.16 34.5702 12.12 34.5702 8C34.5702 3.88 31.4102 0.84 27.1502 0.84C22.8502 0.84 19.6902 3.9 19.6902 8C19.6902 12.1 22.8502 15.16 27.1502 15.16ZM27.1502 13.38C24.0102 13.38 21.6902 11.1 21.6902 8C21.6902 4.9 24.0102 2.62 27.1502 2.62C30.2502 2.62 32.5702 4.9 32.5702 8C32.5702 11.1 30.2502 13.38 27.1502 13.38ZM42.7071 15.16C46.4071 15.16 48.1271 13.32 48.1271 11.18C48.1271 6.04 39.6471 8.18 39.6471 4.76C39.6471 3.54 40.6671 2.54 43.0471 2.54C44.2871 2.54 45.6671 2.9 46.8871 3.68L47.5471 2.08C46.3871 1.28 44.6871 0.84 43.0471 0.84C39.3671 0.84 37.6871 2.68 37.6871 4.84C37.6871 10.04 46.1671 7.88 46.1671 11.3C46.1671 12.52 45.1271 13.46 42.7071 13.46C40.9071 13.46 39.1271 12.78 38.0871 11.84L37.3471 13.4C38.4671 14.44 40.5671 15.16 42.7071 15.16ZM58.309 15.16C60.489 15.16 62.369 14.4 63.649 12.96L62.349 11.7C61.269 12.84 59.949 13.38 58.409 13.38C55.249 13.38 52.909 11.1 52.909 8C52.909 4.9 55.249 2.62 58.409 2.62C59.949 2.62 61.269 3.14 62.349 4.28L63.649 3.02C62.369 1.58 60.489 0.84 58.329 0.84C54.069 0.84 50.909 3.86 50.909 8C50.909 12.14 54.069 15.16 58.309 15.16ZM73.5291 15.16C77.7891 15.16 80.9491 12.12 80.9491 8C80.9491 3.88 77.7891 0.84 73.5291 0.84C69.2291 0.84 66.0691 3.9 66.0691 8C66.0691 12.1 69.2291 15.16 73.5291 15.16ZM73.5291 13.38C70.3891 13.38 68.0691 11.1 68.0691 8C68.0691 4.9 70.3891 2.62 73.5291 2.62C76.6291 2.62 78.9491 4.9 78.9491 8C78.9491 11.1 76.6291 13.38 73.5291 13.38ZM102.437 0.999999L98.5768 12.44L94.7168 0.999999H92.8768L88.9368 12.38L85.1568 0.999999H83.0968L87.7768 15H89.9168L93.7368 3.82L97.5568 15H99.6568L104.337 0.999999H102.437ZM150.383 15.16C154.083 15.16 155.803 13.32 155.803 11.18C155.803 6.04 147.323 8.18 147.323 4.76C147.323 3.54 148.343 2.54 150.723 2.54C151.963 2.54 153.343 2.9 154.563 3.68L155.223 2.08C154.063 1.28 152.363 0.84 150.723 0.84C147.043 0.84 145.363 2.68 145.363 4.84C145.363 10.04 153.843 7.88 153.843 11.3C153.843 12.52 152.803 13.46 150.383 13.46C148.583 13.46 146.803 12.78 145.763 11.84L145.023 13.4C146.143 14.44 148.243 15.16 150.383 15.16ZM170.185 15H172.285L165.925 0.999999H163.945L157.605 15H159.665L161.205 11.5H168.645L170.185 15ZM161.905 9.9L164.925 3.04L167.945 9.9H161.905ZM175.373 15H177.373V0.999999H175.373V15ZM192.605 0.999999V11.44L184.205 0.999999H182.565V15H184.565V4.56L192.965 15H194.605V0.999999H192.605ZM202.575 15H204.555V2.74H209.355V0.999999H197.775V2.74H202.575V15ZM224.364 0.999999H218.904V15H220.904V10.76H224.364C228.004 10.76 230.204 8.92 230.204 5.88C230.204 2.84 228.004 0.999999 224.364 0.999999ZM224.304 9.02H220.904V2.74H224.304C226.864 2.74 228.204 3.88 228.204 5.88C228.204 7.88 226.864 9.02 224.304 9.02ZM236.143 13.26V8.74H243.163V7.04H236.143V2.74H244.023V0.999999H234.143V15H244.303V13.26H236.143ZM251.321 15H253.301V2.74H258.101V0.999999H246.521V2.74H251.321V15ZM263.279 13.26V8.74H270.299V7.04H263.279V2.74H271.159V0.999999H261.279V15H271.439V13.26H263.279ZM287.218 15L283.898 10.3C285.858 9.6 286.978 8.04 286.978 5.88C286.978 2.84 284.778 0.999999 281.138 0.999999H275.678V15H277.678V10.74H281.138C281.438 10.74 281.738 10.72 282.018 10.7L285.038 15H287.218ZM281.078 9.04H277.678V2.74H281.078C283.638 2.74 284.978 3.88 284.978 5.88C284.978 7.88 283.638 9.04 281.078 9.04ZM295.289 15.16C298.989 15.16 300.709 13.32 300.709 11.18C300.709 6.04 292.229 8.18 292.229 4.76C292.229 3.54 293.249 2.54 295.629 2.54C296.869 2.54 298.249 2.9 299.469 3.68L300.129 2.08C298.969 1.28 297.269 0.84 295.629 0.84C291.949 0.84 290.269 2.68 290.269 4.84C290.269 10.04 298.749 7.88 298.749 11.3C298.749 12.52 297.709 13.46 295.289 13.46C293.489 13.46 291.709 12.78 290.669 11.84L289.929 13.4C291.049 14.44 293.149 15.16 295.289 15.16ZM314.051 7.74C315.151 7.2 315.931 6.14 315.931 4.62C315.931 2.36 314.131 0.999999 310.911 0.999999H304.631V15H311.311C314.851 15 316.671 13.62 316.671 11.22C316.671 9.36 315.631 8.18 314.051 7.74ZM310.731 2.62C312.771 2.62 313.931 3.38 313.931 4.86C313.931 6.34 312.771 7.1 310.731 7.1H306.631V2.62H310.731ZM311.231 13.38H306.631V8.72H311.231C313.451 8.72 314.651 9.44 314.651 11.06C314.651 12.68 313.451 13.38 311.231 13.38ZM326.568 15.16C330.268 15.16 332.488 13.02 332.488 8.96V0.999999H330.548V8.88C330.548 11.98 329.108 13.38 326.588 13.38C324.068 13.38 322.648 11.98 322.648 8.88V0.999999H320.648V8.96C320.648 13.02 322.888 15.16 326.568 15.16ZM349.128 15L345.808 10.3C347.768 9.6 348.888 8.04 348.888 5.88C348.888 2.84 346.688 0.999999 343.048 0.999999H337.588V15H339.588V10.74H343.048C343.348 10.74 343.648 10.72 343.928 10.7L346.948 15H349.128ZM342.988 9.04H339.588V2.74H342.988C345.548 2.74 346.888 3.88 346.888 5.88C346.888 7.88 345.548 9.04 342.988 9.04ZM362.819 12.48C361.819 13.12 360.719 13.38 359.539 13.38C356.319 13.38 353.979 11.08 353.979 8C353.979 4.88 356.319 2.62 359.559 2.62C361.139 2.62 362.459 3.12 363.619 4.24L364.859 3C363.579 1.58 361.699 0.84 359.479 0.84C355.139 0.84 351.979 3.86 351.979 8C351.979 12.14 355.139 15.16 359.439 15.16C361.399 15.16 363.339 14.56 364.739 13.38V7.92H362.819V12.48ZM407.795 15H417.375V13.26H409.795V0.999999H407.795V15ZM426.736 15.16C430.996 15.16 434.156 12.12 434.156 8C434.156 3.88 430.996 0.84 426.736 0.84C422.436 0.84 419.276 3.9 419.276 8C419.276 12.1 422.436 15.16 426.736 15.16ZM426.736 13.38C423.596 13.38 421.276 11.1 421.276 8C421.276 4.9 423.596 2.62 426.736 2.62C429.836 2.62 432.156 4.9 432.156 8C432.156 11.1 429.836 13.38 426.736 13.38ZM448.253 0.999999V11.44L439.853 0.999999H438.213V15H440.213V4.56L448.613 15H450.253V0.999999H448.253ZM455.444 15H461.344C465.844 15 468.904 12.16 468.904 8C468.904 3.84 465.844 0.999999 461.344 0.999999H455.444V15ZM457.444 13.26V2.74H461.224C464.684 2.74 466.904 4.86 466.904 8C466.904 11.14 464.684 13.26 461.224 13.26H457.444ZM479.287 15.16C483.547 15.16 486.707 12.12 486.707 8C486.707 3.88 483.547 0.84 479.287 0.84C474.987 0.84 471.827 3.9 471.827 8C471.827 12.1 474.987 15.16 479.287 15.16ZM479.287 13.38C476.147 13.38 473.827 11.1 473.827 8C473.827 4.9 476.147 2.62 479.287 2.62C482.387 2.62 484.707 4.9 484.707 8C484.707 11.1 482.387 13.38 479.287 13.38ZM500.804 0.999999V11.44L492.404 0.999999H490.764V15H492.764V4.56L501.164 15H502.804V0.999999H500.804ZM551.681 0.999999H546.221V15H548.221V10.76H551.681C555.321 10.76 557.521 8.92 557.521 5.88C557.521 2.84 555.321 0.999999 551.681 0.999999ZM551.621 9.02H548.221V2.74H551.621C554.181 2.74 555.521 3.88 555.521 5.88C555.521 7.88 554.181 9.02 551.621 9.02ZM571.216 15H573.316L566.956 0.999999H564.976L558.636 15H560.696L562.236 11.5H569.676L571.216 15ZM562.936 9.9L565.956 3.04L568.976 9.9H562.936ZM587.944 15L584.624 10.3C586.584 9.6 587.704 8.04 587.704 5.88C587.704 2.84 585.504 0.999999 581.864 0.999999H576.404V15H578.404V10.74H581.864C582.164 10.74 582.464 10.72 582.744 10.7L585.764 15H587.944ZM581.804 9.04H578.404V2.74H581.804C584.364 2.74 585.704 3.88 585.704 5.88C585.704 7.88 584.364 9.04 581.804 9.04ZM591.936 15H593.936V0.999999H591.936V15ZM603.207 15.16C606.907 15.16 608.627 13.32 608.627 11.18C608.627 6.04 600.147 8.18 600.147 4.76C600.147 3.54 601.167 2.54 603.547 2.54C604.787 2.54 606.167 2.9 607.387 3.68L608.047 2.08C606.887 1.28 605.187 0.84 603.547 0.84C599.867 0.84 598.187 2.68 598.187 4.84C598.187 10.04 606.667 7.88 606.667 11.3C606.667 12.52 605.627 13.46 603.207 13.46C601.407 13.46 599.627 12.78 598.587 11.84L597.847 13.4C598.967 14.44 601.067 15.16 603.207 15.16Z" fill="url(#paint0_linear)"></path>
                    <defs>
                        <linearGradient id="paint0_linear" x1="61.9921" y1="8.00018" x2="609.539" y2="8.00016" gradientUnits="userSpaceOnUse">
                            <stop stop-color="#F8C36C"></stop>
                            <stop offset="1" stop-color="#D29735"></stop>
                        </linearGradient>
                    </defs>
                </svg>
            </div>
        </div>
        <div class="warning">Чрезмерное употребление алкоголя вредит вашему здоровью.</div>
    </article>
</template>
<script>
import Advantage from '../components/Advantage.vue';
export default {
  components: { Advantage },
    name: "romanov",
    transition() {
        if (!localStorage.fromTo) return 'slide-left';

        const { from, to } = JSON.parse(localStorage.fromTo);
        return to > from ? 'slide-left' : 'slide-right'
    },
    data() {
        return {
            leftOpen: false,
            rightOpen: false,
            currentNum: 0,
            advantages: [
                {
                    num: 1,
                    text: "Под золотым колпаком с отрывным кольцом пробка типа Камю с золотой шляпкой.",
                },
                {
                    num: 3,
                    text: "Герб Романовых и герб Бернадоттов.",
                },
                {
                    num: 5,
                    text: "Переосмысление формы бутылки — <br> отсылка к наследию.",
                },
                {
                    num: 7,
                    text: "Два вида золотой фольги и двойное конгревное тиснение.",
                },
            ],
            advRight: [
                {
                    num: 2,
                    text: "Символика солнца как один из узнаваемых атрибутов тронного зала царской семьи Романовых.",
                },

                {
                    num: 4,
                    text: "Дно с уникальным рельефным искрящимся рисунком с хрустальным переливом.",
                },
                {
                    num: 6,
                    text: "«Слепое» тиснение.",
                },
                {
                    num: 8,
                    text: "Стилизованный герб Российской империи, выполненный рельефом в стекле.",
                }
            ]
        }
    },
    methods: {
        toggle(direction) {
            switch (direction) {
                case 'right':
                    this.rightOpen = !this.rightOpen;
                    break;
                case 'left':
                    this.leftOpen = !this.leftOpen;
                    break;
            }

            // if (!this.leftOpen && !this.rightOpen) {
            //     this.currentNum = 0;
            // }
        },
        btnClick(num) {
            this.currentNum = num;
        },
    },
}
</script>
<style lang="">

</style>
